#+STARTUP: hidestars

** TODO Tangle to init.el [3/4]

   - [X] Add =:tangle no= to the block below
   - [X] Remove =:tangle= header from source blocks.
   - [X] Add date completed
   - [ ] Add prompt before overwriting =init.el=.  OR... just do it and backup old one?

   #+BEGIN_SRC emacs-lisp :tangle no
     (cons
      (car 
       (org-babel-tangle-file
	buffer-file-name
	(expand-file-name (concat user-emacs-directory "init.el"))
	"emacs-lisp"))
      (format-time-string "%Y-%m-%d.%H-%M-%S" (current-time)))
   #+END_SRC

   #+RESULTS:
   : (c:/Users/steve/AppData/Roaming/.emacs.d/init.el . 2017-10-15.15-52-16)


